---
kind: method
id: M:Autodesk.Revit.DB.FilledRegion.GetBoundaries
source: html/5309fd5b-4a99-2d1d-665c-6153a8607012.htm
---
# Autodesk.Revit.DB.FilledRegion.GetBoundaries Method

Gets the boundaries.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetBoundaries()
```

## Returns
The filled region boundaries.